{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Database Application Development",
      "department": "Electrical and Computer Engineering",
      "duration": "22018-2019",
      "school_name": "Seneca College"
    },
    {
      "awards_achievements": null,
      "degree": "Software and Information Systems Testing",
      "department": "Electrical and Computer Engineering",
      "duration": "2017-2018",
      "school_name": "Fanshawe College"
    },
    {
      "awards_achievements": null,
      "degree": "Computer Science Engineering",
      "department": "Computer Engineering",
      "duration": "2013-2017",
      "school_name": "G.Z.S College of Engineering and Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_PayalGupta",
  "highlighted_projects": [
    {
      "description": "Developed an HR Management System in Java using JDBC, MySQL, Servlets, JavaScript. The application supported both user and HR login, the user had the access to their employment details as well as the privilege to edit their information and the HR had access to view all users with privileges to add, remove and edit a user.",
      "name": "HR Management System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux clustering monitoring agent to monitor, collect and analyze data from host machines in a 10 node cluster over a network in a PostgreSQL database provisioned using docker container using bash scripts for better business decisions and resources planning.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a CLI interface using MVC architecture for users to create, read and delete tweets through Twitter RESTful API. Performed testing using JUnit test cases.",
        "JDBC App: Constructed the DAO implementation of retail customer orders through JDBC with PostgreSQL. The data manipulation through CRUD was tested.",
        "Grep App: Implemented Grep application in Java which simulates the Linux grep command to find patterns in a file and write them into another file. The implemented code was then optimized using Lambda and Streams API"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Payal Gupta",
  "others": [
    {
      "bullets": [
        "AWS Cloud Practitioner",
        "Python for Data Science"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Volunteer, BANGO: Organized social events and provided support to the NGO through digital marketing and developing their website.",
        "Volunteer, Feeding India: Conducted awareness events to eliminate hunger and food wastage."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implemented various projects successfully using agile methodologies involving SQL, Bash, Java, Maven, Docker in Linux(CentOS and Ubuntu) and WSL. Participated in scrum ceremonies and collaborated with team members.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "Canada Life",
      "description": "Worked on Agile and Waterfall projects as a QA Lead. Identified test scenarios, test data, test environment, and the scope of testing to be performed based on project requirements. Created automation scripts for regression testing using a selenium-based testing framework. Created SQL queries to collect test data from different sources like Salesforce and different databases. Performed functional, integration, regression, accessibility, ETL, API testing and coordinated with teams performing non-functional testing like performance and security testing. Provided support for weekly production deployments.",
      "duration": "2018-2020",
      "title": "Quality Assurance Analyst"
    },
    {
      "company": "Delhi Heart Institute",
      "description": "Designed and developed the website for the hospital for their new branch to replace the previous outdated website. Coordinated with the stakeholders for the requirements and effectively translated those requirements into website design using JavaScript, PHP, HTML, and CSS. ",
      "duration": "2015",
      "title": "Front-End Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "HTML/CSS",
      "Maven",
      "Selenium",
      "BigQuery(Google Cloud Platform)",
      "Dataproc(Google Cloud Platform)"
    ],
    "familiar": [
      "EC2 (Amazon Web Services)",
      "Pandas",
      "Numpy",
      "DynamoDB",
      "Hadoop"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a Results-driven individual who is passionate about software development. I have more than 2 years of experience in the insurance/financial industry as a Quality Assurance Analyst, this experience helped me to build an analytical, detail-oriented mindset and also exposed me to the work culture and methodologies followed in large-scale industry. While I was completing my Bachelor in Computer Science Engineering I could help a non-profit organization by developing their website which helped them to raise funds, this made me more passionate about this field. Since then I have worked on front-end projects using JavaScript, HTML/CSS. Due to my curious personality, I kept on learning the latest technologies like Cloud services(AWS and GCP) side by side. While working in Jarvis I worked on the industry-related application using technologies like Java, Maven, Docker, SQL, Bash, REST API. Through my passion to help others by improving existing methods and enthusiasm to learn new emerging technologies, I will be a great asset to the team and will also be excited about the new upcoming opportunities."
}
